{
  "title": "Algorithmic Agents in the Hybrid Media System: Social Bots, Selective Amplification and Partisan News about COVID-19",
  "authors": [
    {"id": "zduan"},
    {"id": "jli"},
    {"id": "jlukito"},
    {"id": "kcyang", "annotation": ["highlight"]},
    {"id": "fchen"},
    {"id": "dshah"},
    {"id": "syang"}
  ],
  "year": [
    2022
  ],
  "date": "2022-05-17",
  "type": [
    "journal"
  ],
  "topic": [
    "socialmedia",
    "bot",
    "misinformation",
    "covid"
  ],
  "highlight": [],
  "links": [
    {
      "name": "DOI",
      "url": "https://doi.org/10.1093/hcr/hqac012"
    }
  ],
  "altmetric": {
    "doi_id": "10.1093/hcr/hqac012"
  },
  "bibtex_string": "@article{duan2022algorithmic,\n\tauthor = {Duan, Zening and Li, Jianing and Lukito, Josephine and Yang, Kai-Cheng and Chen, Fan and Shah, Dhavan V and Yang, Sijia},\n\ttitle = {Algorithmic Agents in the Hybrid Media System: Social Bots, Selective Amplification, and Partisan News about COVID-19},\n\tjournal = {Human Communication Research},\n\tvolume = {48},\n\tnumber = {3},\n\tpages = {516-542},\n\tyear = {2022},\n\tmonth = {05},\n\tissn = {1468-2958},\n\tdoi = {10.1093/hcr/hqac012},\n\turl = {https://doi.org/10.1093/hcr/hqac012},\n\teprint = {https://academic.oup.com/hcr/article-pdf/48/3/516/44628164/hqac012.pdf}}",
  "abstract": "Social bots, or algorithmic agents that amplify certain viewpoints and interact with selected actors on social media, may influence online discussion, news attention, or even public opinion through coordinated action. Previous research has documented the presence of bot activities and developed detection algorithms. Yet, how social bots influence attention dynamics of the hybrid media system remains understudied. Leveraging a large collection of both tweets (N=1,657,551) and news stories (N=50,356) about the early COVID-19 pandemic, we employed bot detection techniques, structural topic modeling, and time series analysis to characterize the temporal associations between the topics Twitter bots tend to amplify and subsequent news coverage across the partisan spectrum. We found that bots represented 8.98% of total accounts, selectively promoted certain topics and predicted coverage aligned with partisan narratives. Our macro-level longitudinal description highlights the role of bots as algorithmic communicators and invites future research to explain micro-level causal mechanisms."
}