{
	"authors": [
		{"id": "zduan"},
		{"id": "ashao"},
		{"id": "yhu"},
		{"id": "hlee"},
		{"id": "xliao"},
		{"id": "yjsuh"},
		{"id": "jkim"},
		{"id": "kcyang", "annotation": ["highlight"]},
		{"id": "kchen"},
		{"id": "syang"}
	],
	"year": [
		2025
	],
	"date": "2025-04-11",
	"type": [
		"journal"
	],
	"topic": [
		"socialmedia",
		"method"
	],
	"highlight": [],
	"links": [
		{
			"url": "https://doi.org/10.1017/pan.2025.6",
			"name": "DOI"
		},
		{
			"url": "https://arxiv.org/abs/2312.05990",
			"name": "arXiv"
		},
		{
			"url": "https://github.com/ZeningDuan/vMFD",
			"name": "GitHub"
		}
	],
	"altmetric": {
		"doi_id": "10.1017/pan.2025.6"
	},
	"bibtex_string": "@article{duan2025constructing,\n\ttitle={Constructing Vec-tionaries to Extract Message Features from Texts: A Case Study of Moral Content},\n\tDOI={10.1017/pan.2025.6},\n\tjournal={Political Analysis},\n\tauthor={Duan, Zening and Shao, Anqi and Hu, Yicheng and Lee, Heysung and Liao, Xining and Suh, Yoo Ji and Kim, Jisoo and Yang, Kai-Cheng and Chen, Kaiping and Yang, Sijia},\n\tyear={2025},\n\tpages={1-21}}",
	"abstract": "While researchers often study message features like moral content in text, such as party manifestos and social media, their quantification remains a challenge. Conventional human coding struggles with scalability and intercoder reliability. While dictionary-based methods are cost-effective and computationally efficient, they often lack contextual sensitivity and are limited by the vocabularies developed for the original applications. In this paper, we present an approach to construct vec-tionary measurement tools that boost validated dictionaries with word embeddings through nonlinear optimization. By harnessing semantic relationships encoded by embeddings, vec-tionaries improve the measurement of message features from text, especially those in short format, by expanding the applicability of original vocabularies to other contexts. Importantly, a vec-tionary can produce additional metrics to capture the valence and ambivalence of a message feature beyond its strength in texts. Using moral content in tweets as a case study, we illustrate the steps to construct the moral foundations vec-tionary, showcasing its ability to process texts missed by conventional dictionaries and word embedding methods and to produce measurements better aligned with crowdsourced human assessments. Furthermore, additional metrics from the vec-tionary unveiled unique insights that facilitated predicting outcomes such as message retransmission."
}