{
  "authors": [
    {"id": "bperry"},
    {"id": "modabas"},
    {"id": "kcyang", "annotation": ["highlight"]},
    {"id": "blee"},
    {"id": "pkaminski"},
    {"id": "baronson"},
    {"id": "yyahn"},
    {"id": "coser"},
    {"id": "pfreeman"},
    {"id": "jtalbert"}
  ],
  "year": [
    2021
  ],
  "date": "2021-12-07",
  "type": [
    "journal"
  ],
  "topic": [
    "opioid",
    "netsci"
  ],
  "highlight": [],
  "links": [
    {
      "url": " https://doi.org/10.1111/add.15635",
      "name": "DOI"
    }
  ],
  "altmetric": {
    "doi_id": "10.1111/add.15635"
  },
  "bibtex_string": "@article{perry2021new,\n\tauthor = {Perry, Brea L. and Odabas, Meltem and Yang, Kai-Cheng and Lee, Byungkyu and Kaminski, Patrick and Aronson, Brian and Ahn, Yong-Yeol and Oser, Carrie B. and Freeman, Patricia R. and Talbert, Jeffrey C.},\n\ttitle = {New means, new measures: assessing prescription drug-seeking indicators over 10 years of the opioid epidemic},\n\tjournal = {Addiction},\n\tvolume = {117},\n\tnumber = {1},\n\tpages = {195-204},\n\tdoi = {https://doi.org/10.1111/add.15635},\n\turl = {https://onlinelibrary.wiley.com/doi/abs/10.1111/add.15635},\n\tyear = {2021}}",
  "abstract": "Background and aims Prescription drug-seeking (PDS) from multiple prescribers is a primary means of obtaining prescription opioids; however, PDS behavior has probably evolved in response to policy shifts, and there is little agreement about how to operationalize it. We systematically compared the performance of traditional and novel PDS indicators. Design Longitudinal study using a de-identified commercial claims database. Setting United States, 2009–18. Participants A total of 318 million provider visits from 21.5 million opioid-prescribed patients. Measurements We applied binary classification and generalized linear models to compare predictive accuracy and average marginal effect size predicting future opioid use disorder (OUD), overdose and high morphine milligram equivalents (MME). We compared traditional indicators of PDS to a network centrality measure, PageRank, that reflects the prominence of patients in a co-prescribing network. Analyses used the same data and adjusted for patient demographics, region, SES, diagnoses and health services. Findings The predictive accuracy of a widely used traditional measure (N + unique doctors and N + unique pharmacies in 90 days) on OUD, overdose and MME decreased between 2009 and 2018, and performed no better than chance (50% accuracy) after 2015. Binarized PageRank measures however exhibited higher predictive accuracy than the traditional binary measures throughout 2009-2018. Continuous indicators of PDS performed better than binary thresholds, with days of Rx performing best overall with 77–93% predictive accuracy. For example, days of Rx had the highest average marginal effects on overdose and OUD: a 1 standard deviation increase in days of Rx was associated with a 6–8% [confidence intervals (CIs) = 0.058–0.061 and 0.078–0.082] increase in the probability of overdose and a 4–5% (CIs = 0.038–0.043 and 0.047–0.053) increase in the probability of OUD. PageRank performed nearly as well or better than traditional indicators of PDS, with predictive performance increasing after 2016. Conclusions In the United States, network-based measures appear to have increasing promise for identifying prescription opioid drug-seeking behavior, while indicators based on quantity of providers or pharmacies appear to have decreasing utility."
}