{
  "authors": [
    {"id": "fpierri"},
    {"id": "mdeverna"},
    {"id": "kcyang", "annotation": ["highlight"]},
    {"id": "daxelrod"},
    {"id": "jbryden"},
    {"id": "fmenczer"}
  ],
  "year": [
    2023
  ],
  "date": "2023-02-24",
  "type": [
    "journal"
  ],
  "highlight": [],
  "topic": [
    "socialmedia",
    "misinformation",
    "covid"
  ],
  "links": [
    {
      "name": "DOI",
      "url": "https://doi.org/10.2196/42227"
    },
    {
      "name": "arXiv",
      "url": "https://arxiv.org/abs/2209.01675"
    }
  ],
  "altmetric": {
    "doi_id": "10.2196/42227"
  },
  "bibtex_string": "@article{pierri2023one,\n\ttitle={One year of COVID-19 vaccine misinformation on Twitter: longitudinal study},\n\tauthor={Pierri, Francesco and DeVerna, Matthew R and Yang, Kai-Cheng and Axelrod, David and Bryden, John and Menczer, Filippo},\n\tjournal={Journal of Medical Internet Research},\n\tvolume={25},\n\tpages={e42227},\n\tyear={2023},\n\tpublisher={JMIR Publications Toronto, Canada}}",
  "abstract": "Vaccinations play a critical role in mitigating the impact of COVID-19 and other diseases. This study explores COVID-19 vaccine misinformation circulating on Twitter during 2021, when vaccines were being released to the public in an effort to mitigate the global pandemic. Our findings show a low prevalence of low-credibility information compared to mainstream news. However, most popular low-credibility sources had larger reshare volumes than authoritative sources such as the CDC and WHO. We observed an increasing trend in the prevalence of low-credibility news relative to mainstream news about vaccines. We also observed a considerable amount of suspicious YouTube videos shared on Twitter. Tweets by a small group of about 800 'superspreaders' verified by Twitter accounted for approximately 35% of all reshares of misinformation on the average day, with the top superspreader (@RobertKennedyJr) responsible for over 13% of retweets. Low-credibility news and suspicious YouTube videos were more likely to be shared by automated accounts. Our findings are consistent with the hypothesis that superspreaders are driven by financial incentives that allow them to profit from health misinformation. Despite high-profile cases of deplatformed misinformation superspreaders, our results show that in 2021 a few individuals still played an outsize role in the spread of low-credibility vaccine content. Social media policies should consider revoking the verified status of repeat-spreaders of harmful content, especially during public health crises."
}