{
  "authors": [
    {"id": "kcyang", "annotation": ["corresponding_author", "highlight"]}
  ],
  "year": [
    2023
  ],
  "date": "2023-07-01",
  "type": [
    "other"
  ],
  "topic": [
    "bot",
    "socialmedia"
  ],
  "highlight": [],
  "links": [
    {
      "url": "https://www.proquest.com/openview/ba17bd659e1b1aaa5d8527caefd1dfd4",
      "name": "ProQuest"
    }
  ],
 "bibtex_string": "@phdthesis{yang2023social,\n\ttitle={Social Media Bots: Detection, Characterization, and Human Perception},\n\tauthor={Yang, Kai-Cheng},\n\tyear={2023},\n\tmonth={July},\n\tschool={Indiana University},\n\ttype = {PhD thesis}}",
 "abstract": "Social bots, or social media accounts controlled in part by software, have gained significant attention from academia and the public. They can amplify certain viewpoints and interact with selected actors on social media automatically. Recent reports suggest that malicious social bots have been deployed to distort online conversations, influence public opinion, and spread misinformation in various contexts, including elections and public health crises. To understand the behaviors of malicious bots and address their negative impact, I propose an efficient and reliable social bot detection framework using machine learning in the first part of this dissertation. This framework involves the collection of diverse and representative bot samples, along with corresponding human accounts. I create two supervised machine-learning models that focus on explainability and scalability, respectively. Then I apply the proposed models to real-world scenarios. In the second part of the dissertation, I have turned them into publicly available tools serving hundreds of thousands of users. I also conduct extensive analyses to reveal the amplification of misinformation by bots during the COVID-19 pandemic using these tools in the third part. To further comprehend the impact of bots on humans, I perform a human-subject experiment in the fourth part of the dissertation. The results reveal that people tend to overestimate the threat posed by bots and are vulnerable to bot manipulation due to human biases. In light of the recent advancements in generative artificial intelligence models, I conclude the dissertation with future research directions. My work contributes to a deeper understanding of social media bots, which continue to play an integral role in our online information ecosystem."
}