{
  "authors": [
    {"id": "kcyang", "annotation": ["corresponding_author", "highlight"]},
    {"id": "dsingh"},
    {"id": "fmenczer"}
  ],
  "year": [
    2024
  ],
  "date": "2024-09-18",
  "type": [
    "journal"
  ],
  "topic": [
    "genai",
    "socialmedia",
    "bot"
  ],
  "highlight": [
    "highlight"
  ],
  "links": [
    {
      "url": "https://doi.org/10.54501/jots.v2i4.197",
      "name": "DOI"
    },
    {
      "url": "https://arxiv.org/abs/2401.02627",
      "name": "arXiv"
    },
    {
      "url": "https://github.com/osome-iu/fake_gan_accounts",
      "name": "GitHub"
    },
    {
      "url": "https://doi.org/10.5281/zenodo.10436889",
      "name": "Dataset"
    },
    {
      "url": "https://x.com/yang3kc/status/1744360434994405699",
      "name": "Twitter"
    }
  ],
  "altmetric": {
    "arxiv_id": "2401.02627"
  },
  "bibtex_string": "@article{yang2024characteristics,\n\ttitle={Characteristics and Prevalence of Fake Social Media Profiles with AI-generated Faces},\n\tvolume={2},\n\turl={https://tsjournal.org/index.php/jots/article/view/197},\n\tDOI={10.54501/jots.v2i4.197},\n\tnumber={4},\n\tjournal={Journal of Online Trust and Safety},\n\tauthor={Yang, Kai-Cheng and Singh, Danishjeet and Menczer, Filippo},\n\tyear={2024},\n\tmonth={Sep.}}",
  "abstract": "Recent advancements in generative artificial intelligence (AI) have raised concerns about their potential to create convincing fake social media accounts, but empirical evidence is lacking. In this paper, we present a systematic analysis of Twitter (X) accounts using human faces generated by Generative Adversarial Networks (GANs) for their profile pictures. We present a dataset of 1,420 such accounts and show that they are used to spread scams, spam, and amplify coordinated messages, among other inauthentic activities. Leveraging a feature of GAN-generated faces -- consistent eye placement -- and supplementing it with human annotation, we devise an effective method for identifying GAN-generated profiles in the wild. Applying this method to a random sample of active Twitter users, we estimate a lower bound for the prevalence of profiles using GAN-generated faces between 0.021% and 0.044% -- around 10K daily active accounts. These findings underscore the emerging threats posed by multimodal generative AI. We release the source code of our detection method and the data we collect to facilitate further investigation. Additionally, we provide practical heuristics to assist social media users in recognizing such accounts."
}