{
  "authors": [
    {"id": "ctlugo"},
    {"id": "kcyang", "annotation": ["highlight"]},
    {"id": "fmenczer"}
  ],
  "year": [
    2022
  ],
  "date": "2022-05-31",
  "type": [
    "conf"
  ],
  "topic": [
    "socialmedia",
    "politics",
    "bot",
    "misinformation"
  ],
  "highlight": [],
  "links": [
    {
      "url": "https://doi.org/10.1609/icwsm.v16i1.19354",
      "name": "DOI"
    },
    {
      "url": "https://arxiv.org/abs/2010.13691",
      "name": "arXiv"
    }
  ],
  "altmetric": {
    "doi_id": "10.1609/icwsm.v16i1.19354"
  },
  "bibtex_string": "@article{lugo2020manufacture,\n\ttitle={The Manufacture of Partisan Echo Chambers by Follow Train Abuse on Twitter},\n\tvolume={16},\n\turl={https://ojs.aaai.org/index.php/ICWSM/article/view/19354},\n\tDOI={10.1609/icwsm.v16i1.19354},\n\tanumber={1},\n\tjournal={Proceedings of the International AAAI Conference on Web and Social Media},\n\tauthor={Torres-Lugo, Christopher and Yang, Kai-Cheng and Menczer, Filippo},\n\tyear={2022},\n\tmonth={May},\n\tpages={1017-1028}}",
  "abstract": "A growing body of evidence points to critical vulnerabilities of social media, such as the emergence of partisan echo chambers and the viral spread of misinformation. We show that these vulnerabilities are amplified by abusive behaviors associated with so-called 'follow trains' on Twitter, in which long lists of like-minded accounts are mentioned for others to follow. We present the first systematic analysis of a large U.S. hyper-partisan train network. We observe an artificial inflation of influence: accounts heavily promoted by follow trains profit from a median six-fold increase in daily follower growth. This catalyzes the formation of highly clustered echo chambers, hierarchically organized around a dense core of active accounts. Train accounts also engage in other behaviors that violate platform policies: we find evidence of activity by inauthentic automated accounts and abnormal content deletion, as well as amplification of toxic content from low-credibility and conspiratorial sources. Some train accounts have been active for years, suggesting that platforms need to pay greater attention to this kind of abuse."
}